app/controllers/quotes_controller.rb

 def show
    @quote=Quote.find(params[:id])
---
SELECT * FROM `quotes` WHERE (`quotes`.`id` = 81)

  def update
    @quote = Quote.find(params[:id])
    respond_to do |format|
      if @quote.update_attributes(params[:quote])
---
SELECT * FROM `quotes` WHERE (`quotes`.`id` = 81)
UPDATE `quotes` SET `last_rated_at` = '2009-11-21 00:00:00', `updated_at` = '2010-03-06 00:21:46' WHERE `id` = 81