app/controllers/sessions_controller.rb

  def create
    logout_keeping_session!
    @session=params[:session]
    #user = User.authenticate(params[:login], params[:password])
    user = User.authenticate(@session[:login],@session[:password])
    if user
      self.current_user = user
      # Protects against session fixation attacks, causes request forgery
      # protection if user resubmits an earlier form using back
      # button. Uncomment if you understand the tradeoffs.
      # reset_session
      #new_cookie_flag = (params[:remember_me] == "1")
      new_cookie_flag = (@session[:remember_me] == "1")
      handle_remember_cookie! new_cookie_flag
      @agent = Agent.find_by_agent_code(user.agent_code)
      @agency = Agency.find_by_agency_code(@agent.agency_code)
---
SELECT * FROM `agents` WHERE (`agents`.`agent_code` = 'ABC-001-999988') LIMIT 1
SELECT * FROM `agencies` WHERE (`agencies`.`agency_code` = '00001') LIMIT 1